TexasInstruments/f29h85x-mcal/plugins/Uart_TI_F29H85x/generate/include/Cdd_Uart_Cfg.h
/*********************************************************************************************************************
 *  COPYRIGHT
 *  ------------------------------------------------------------------------------------------------------------------
 *  \verbatim
 *
 *   TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 *   Copyright (c) 2025 Texas Instruments Incorporated
 *
 *   All rights reserved not granted herein.
 *
 *   Limited License.
 *
 *   Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 *   license under copyrights and patents it now or hereafter owns or controls to
 *   make, have made, use, import, offer to sell and sell ("Utilize") this software
 *   subject to the terms herein. With respect to the foregoing patent license,
 *   such license is granted solely to the extent that any such patent is necessary
 *   to Utilize the software alone. The patent license shall not apply to any
 *   combinations which include this software, other than combinations with devices
 *   manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 *   Redistributions must preserve existing copyright notices and reproduce this license
 *   (including the above copyright notice and the disclaimer and (if applicable) source
 *   code license limitations below) in the documentation and/or other materials provided
 *   with the distribution.
 *
 *   Redistribution and use in binary form, without modification, are permitted provided
 *   that the following conditions are met:
 *
 *   * No reverse engineering, decompilation, or disassembly of this software is
 *     permitted with respect to any software provided in binary form.
 *   * Any redistribution and use are licensed by TI for use only with TI Devices.
 *   * Nothing shall obligate TI to provide you with source code for the software
 *     licensed and provided to you in object code.
 *
 *   If software source code is provided to you, modification and redistribution of the
 *   source code are permitted provided that the following conditions are met:
 *
 *   * Any redistribution and use of the source code, including any resulting derivative
 *     works, are licensed by TI for use only with TI Devices.
 *   * Any redistribution and use of any object code compiled from the source code
 *     and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 *   Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 *   may be used to endorse or promote products derived from this software without
 *   specific prior written permission.
 *
 *   DISCLAIMER.
 *
 *   THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 *   WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 *   AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 *   LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 *   GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 *   CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *   (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 *   EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *  \endverbatim
 *  ------------------------------------------------------------------------------------------------------------------
 *  FILE DESCRIPTION
 *  ------------------------------------------------------------------------------------------------------------------
 *  File:       Cdd_Uart_Cfg.h
 *  Generator:  Elektrobit Tresos
 *
 *  Description:  This file contains generated configuration data
 *********************************************************************************************************************/
#ifndef CDD_UART_CFG_H
#define CDD_UART_CFG_H

/** \addtogroup CDD_UART
 *  @{
 */
#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************************************************************
 * Header Files
 *********************************************************************************************************************/

#include "hw_memmap.h"
#include "hw_uart.h"
#include "Cdd_Uart_Cbk.h"

/*********************************************************************************************************************
 * Version Check (if required)
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Preprocessor #define Constants
 *********************************************************************************************************************/
#ifndef DOXYGEN_SHOULD_SKIP_THIS

/* CDD UART Driver Configuration SW Version Info */
#define CDD_UART_CFG_MAJOR_VERSION           ([!"substring-before($moduleSoftwareVer,'.')"!]U)
#define CDD_UART_CFG_MINOR_VERSION           ([!"substring-before(substring-after($moduleSoftwareVer,'.'),'.')"!]U)
#define CDD_UART_CFG_PATCH_VERSION           ([!"substring-after(substring-after($moduleSoftwareVer,'.'),'.')"!]U)
[!SELECT "as:modconf('Cdd_Uart/Cdd')[as:path(node:dtos(.))='/TI_F29H85x/Cdd_Uart/Cdd']"!]
/** \brief Maximum UART HW Instances on Board */
#define CDD_UART_MAX_NUM_HWUNIT                     (uint8)([!"num:i(count(CddUartConfigSet[1]/CddUartConfig/*))"!]U)

/** \brief Enable/Disable Pre compile variant.*/
#define CDD_UART_CFG_PRE_COMPILE_VARIANT            [!IF "IMPLEMENTATION_CONFIG_VARIANT = 'VariantPreCompile'"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]

/** \brief Enable/Disable DEV error detection.*/
#define CDD_UART_CFG_DEV_ERROR_DETECT               [!IF "CddUartGeneral/CddUartDevErrorDetect = 'true'"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]

/** \brief Enable/Disable Cdd_Uart_GetVersionInfo().*/
#define CDD_UART_CFG_GET_VERSION_INFO_API           [!IF "CddUartGeneral/CddUartVersionInfoApi = 'true'"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]

/** \brief Pre compile pointer to configuration structure */
[!LOOP "CddUartConfigSet"!][!//
#define CDD_UART_INIT_CONFIG_PC                     Cdd_Uart_Config
[!ENDLOOP!][!//

/** \brief Defines symbolic names for the CddUart HW unit ID's (CddUartHWUnitId) */
[!LOOP "CddUartConfigSet/CddUartConfig/*"!][!//
#define CddUartConf_CddUartConfigSet_[!"@name"!] ([!"(node:value(CddUartHWUnitId))"!]U) /*~ASR~*/
[!ENDLOOP!][!//

/** \brief CddUart ConfigSet Instance interrupt definition */
[!LOOP "CddUartConfigSet/CddUartConfig/*"!][!//
#define CDD_[!"(node:ref(CddUartInstance)/InstanceName)"!]_ENABLE
[!IF "CddUartInteruptType = 'CDD_UART_ISR_CAT1_RTINT'"!][!//
#define CDD_[!"(node:ref(CddUartInstance)/InstanceName)"!]_ISR_CAT1_RTINT
[!ELSEIF "CddUartInteruptType = 'CDD_UART_ISR_CAT1_INT'"!][!//
#define CDD_[!"(node:ref(CddUartInstance)/InstanceName)"!]_ISR_CAT1_INT
[!ELSE!][!//
#define CDD_[!"(node:ref(CddUartInstance)/InstanceName)"!]_ISR_CAT2
[!ENDIF!][!//
[!ENDLOOP!][!//

#endif /* DOXYGEN_SHOULD_SKIP_THIS */
/*********************************************************************************************************************
 * Exported Preprocessor #define Macros
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Type Declarations
 *********************************************************************************************************************/
/* Forward declaration of Cdd_Uart configuration structure */
struct Cdd_Uart_ConfigTag;

/*********************************************************************************************************************
 * Exported Object Declarations
 *********************************************************************************************************************/

[!LOOP "CddUartConfigSet"!][!//
extern CONST(struct Cdd_Uart_ConfigTag, CDD_UART_CONFIG_DATA) Cdd_Uart_Config;
[!ENDLOOP!][!//
[!ENDSELECT!]
/*********************************************************************************************************************
 *  Exported Function Prototypes
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Exported Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/

#ifdef __cplusplus
}
#endif
/**
 * @}
 */
#endif /* CDD_UART_CFG_H */
/*********************************************************************************************************************
 *  End of File: Cdd_Uart_Cfg.h
 *********************************************************************************************************************/
